package com.agfa.he.sh.common.util;

import java.util.Random;

import org.apache.commons.lang3.StringUtils;

import com.agfa.he.sh.common.util.PinyinUtil.PinyinCaseType;

public class PseudoRandomUtil {
	
	public static final int randomInt(int bound) {
		Random rnd = new Random();
		return rnd.nextInt(bound);
	}	
	
//	public static void main(String[] args) {
//		String phone = "13501234567";
//		System.out.println(randomPhoneNumber(phone));	
//		
//		String name = randomName("曹可颖", "F");
//		System.out.println(name);
//		System.out.println(PinyinUtil.generatePinyinStr(name, PinyinCaseType.CAPITALIZED, false));
//		System.out.println(PinyinUtil.generatePinyinStr(name, PinyinCaseType.UPPERCASE, true));
//	}
//	
	private static final char[] DIGITS = new char[] {'0','1','2','3','4','5','6','7','8','9'};
	
	private static final char[] CH_FAMILY_NAMES = new char[] {
		'丁','万','丛','严','乔','于','付','代','任','伊','何','余','佟','侯','修','倪','傅','全','兰','关','冯','冷','刁','刘','初','包','华','单','卜','卢','史','叶','吕','吴','周','唐','商','喻','国','夏','姚','姜','娄','孔','孙','孟',
		'季','宁','安','宋','宗','宫','寇','富','尚','尤','尹','屈','岳','崔','左','巴','常','庄','庞','康','廉','廖','张','彭','徐','战','戚','戴','房','文','方','施','时','景','曲','曹','曾','朱','朴','李','杜','杨','林','柏','柳','柴',
		'栾','梁','梅','樊','武','段','殷','毕','毛','江','汤','汪','沈','沙','洪','温','滕','满','潘','焦','熊','牛','牟','王','田','申','白','盖','盛','石','祁','祝','秦','程','穆','窦','章','管','纪','罗','翟','耿','聂','肇','肖','胡',
		'臧','艾','芦','苏','苑','苗','范','荆','荣','葛','董','蒋','蔡','薛','袁','裴','褚','解','詹','许','谢','谭','谷','费','贺','贾','赫','赵','路','车','辛','边','迟','邓','邢','那','邱','邵','邸','邹','郎','郑','郝','郭','都','鄂',
		'金','钟','钱','门','闫','闵','闻','阎','陆','陈','陶','隋','雷','霍','靳','鞠','韩','项','顾','颜','马','高','魏','鲁','鲍','黄','齐','龙','龚'
	};
	
	private static final char[] CH_FIRST_NAMES_F1 = new char[] {
		'一','丛','东','严','丰','丹','为','丽','义','乐','乔','书','云','亚','京','亮','仁','会','伟','伶','佳','侠','俊','俏','俐','俭','倩','健','傲','允','元','光','克','兰','兴','兵','冉','军','冬','冰','冲','冶','净','凌','凝','凡',
		'凤','凯','刚','利','剑','力','勃','勇','勤','化','卉','华','卓','南','博','卫','原','双','可','叶','吉','君','咏','品','响','哲','唯','喆','喜','嘉','囡','园','圆','坚','坤','垚','培','堂','堃','壮','夏','多','天','奇','奕','好',
		'妍','妤','妮','姗','姝','姣','威','娃','娅','娇','娜','娟','娣','娥','婉','婕','婧','婵','婷','媛','嫣','子','季','学','宁','宇','安','宏','实','宪','宴','容','宽','宾','密','寒','小','尧','展','山','屹','岚','岩','岳','峥','峰',
		'崇','崴','嵘','嵩','巍','川','巧','帅','帆','希','平','庆','序','延','建','开','弘','强','彤','彦','彧','彩','彬','影','征','微','心','志','忠','忱','思','怡','恋','恒','恕','悦','惠','想','慈','慧','懿','戈','成','扬','拉','捷',
		'攀','放','政','敏','敬','文','斌','斐','斯','新','方','旋','旭','旸','旺','昀','昂','昆','昊','明','昕','星','春','昭','昱','晋','晓','晔','晖','晗','晨','景','晰','晴','晶','智','曦','曼','月','朋','朔','朗','杉','来','杨','杭',
		'杰','松','林','枫','柯','柳','格','桃','桐','桥','桦','梅','梦','棠','森','楠','榕','欢','欣','欧','歌','正','毅','毓','民','水','永','汀','江','沈','沫','泉','泓','波','泳','泽','洁','洋','津','洪','浩','海','涛','润','涵','淑',
		'淳','淼','清','游','湘','源','溪','满','滢','滨','漫','潇','澄','澜','瀛','灵','炎','炜','烁','烨','焕','焱','然','煜','熙','燕','爱','爽','牧','特','玉','玢','玥','玫','玮','环','玲','珂','珊','珍','珏','珠','珺','理','琛','琢',
		'琦','琨','琪','琰','琳','琴','琼','瑕','瑛','瑜','瑞','瑶','瑾','璇','璐','璞','璠','甜','甦','田','申','男','畅','畔','皎','皓','盈','直','盼','真','睿','石','研','砚','硕','磊','祎','祯','祺','禹','禾','秀','秋','科','程','立',
		'竞','童','竹','笑','笛','策','筠','素','红','纪','纯','维','美','群','羽','翀','翔','翠','翼','聪','臻','舒','航','良','艳','艺','艾','芊','芝','芬','芮','花','芳','芸','芹','苏','苓','苗','英','苹','茁','范','茉','茜','茵','茹',
		'荔','荣','荻','莉','莎','莲','莹','莺','菁','菊','菲','萃','萌','萍','营','萱','葳','葵','蒙','蓉','蓓','蔓','蔚','蔷','蕊','蕴','蕾','薇','虹','裕','言','诗','诺','谦','贞','贤','贺','赛','赢','赤','赫','超','越','跃','路','轩',
		'轶','辉','辰','达','迎','进','远','连','迪','郁','野','金','鑫','钢','钧','钰','铃','铭','铮','锋','锐','锦','键','镝','闯','闻','阅','阳','陆','隽','雁','雅','雨','雪','雯','雷','霁','霄','震','霏','霓','霖','霜','霞','露','青',
		'靓','靖','静','非','革','韬','音','韵','顺','颂','颍','颖','颜','风','飒','飞','香','馥','馨','驰','骏','魏','鸣','鸥','鸽','鸿','鹃','鹏','鹤','鹭','鹰','黎','默','齐','龙'
	};
	
	private static final char[] CH_FIRST_NAMES_F21 = new char[] {
		'一','丁','万','三','丕','世','丙','业','丛','东','丝','严','中','丰','丹','为','丽','举','乃','久','义','之','乐','乔','乙','九','也','书','予','争','二','于','云','井','亚','亦','京','亭','亮','人','仁','今','从','仕','付','仙',
		'代','令','以','仪','仲','任','伊','伏','会','伟','传','伯','伶','佐','佑','余','作','佩','佰','佳','依','俊','俏','俐','保','信','俭','修','倚','倩','健','傲','儒','允','元','兆','先','光','克','全','公','兰','关','兴','兵','其',
		'再','军','冠','冬','冰','冷','净','凌','凡','凤','凯','函','刘','则','利','剑','力','功','加','劲','勇','勋','勤','化','北','千','升','卉','华','卓','南','博','占','卫','印','厚','原','又','友','双','发','叔','古','召','可','叶',
		'司','合','吉','同','名','向','君','含','启','周','和','咏','品','哈','哓','哲','唯','啟','善','喜','嘉','四','园','国','圆','圣','在','均','坤','垂','培','基','增','墨','士','壮','声','复','夏','夕','多','大','天','太','奇','奉',
		'奎','奕','好','如','妍','妙','妮','姗','姝','姣','姬','姿','威','娅','娇','娜','娟','婀','婉','婕','婧','婵','婷','媚','媛','嫣','嫦','子','孔','存','孝','孟','季','学','宁','宇','守','安','宏','宗','定','宛','宜','宝','宣','宪',
		'宵','家','容','宽','宾','寅','密','富','寒','寿','尊','小','少','尔','尚','居','展','山','屹','岚','岩','岫','岱','岳','峥','峰','峻','崇','巍','川','左','巧','巨','巾','布','帅','师','希','帮','常','帼','平','年','幸','幼','广',
		'庆','应','庚','庭','康','延','廷','建','开','式','弘','录','彤','彥','彦','彩','彬','影','征','得','微','德','心','必','忆','志','忠','念','忻','怀','思','怡','恒','恩','悦','惜','惠','意','慎','慕','慧','懿','戈','成','所','才',
		'扬','承','抒','拉','拥','振','换','捷','支','改','政','效','敏','敬','文','斌','斯','新','方','施','旖','日','旭','时','昀','昆','昊','昌','明','易','昕','星','映','春','昭','昱','显','晋','晏','晓','晔','晗','晚','晨','普','景',
		'晴','晶','智','曙','曦','更','曼','月','有','朋','朝','木','本','术','杉','李','杏','来','杨','杰','松','林','枝','枫','柏','柯','柳','树','校','栢','栩','根','格','桂','桃','桐','梅','梓','梦','森','楚','楠','槿','樱','次','欢',
		'欣','歆','歌','正','步','武','殊','殿','毅','毓','毛','民','水','永','汇','汉','汝','江','汶','沁','沈','沐','沙','沛','沫','河','治','沿','泉','泊','泓','法','波','泰','泳','泽','洁','洋','洗','洛','津','洪','济','浩','海','涤',
		'润','涵','淑','淳','添','淼','清','湘','源','溪','满','滢','滨','漫','潇','澜','瀚','瀛','灵','灿','炎','炜','炳','点','烨','焕','焱','然','煜','照','熙','燕','爱','爽','牧','献','玄','玉','王','玖','玥','玫','玮','环','现','玲',
		'玺','珂','珈','珊','珍','珠','珺','理','琦','琪','琬','琳','琴','琼','瑀','瑛','瑜','瑞','瑰','瑶','瑷','瑾','璐','璟','甜','生','田','甲','申','男','畅','留','登','白','百','皎','皓','盈','益','盛','相','盼','真','睿','知','石',
		'研','砚','硕','碧','礼','祉','祎','祖','祝','祥','禄','福','禹','秀','秉','秋','科','积','程','稚','穆','立','竞','竟','章','童','端','竹','笑','筠','筱','米','粉','粤','精','素','索','紫','繁','红','纪','纯','纳','绍','经','结',
		'绣','继','绪','绮','维','绿','罗','美','群','羽','翊','翔','翠','翼','耀','联','聪','肃','肇','肖','育','胜','腊','腾','自','至','致','舒','舜','航','良','艳','艺','艾','芊','芙','芝','芬','芮','芯','花','芳','芷','芸','苏','苓',
		'苗','若','英','茂','范','茉','茗','茜','茹','荔','荟','荣','荫','荷','莉','莎','莫','莲','莹','菁','菊','菲','萃','萌','萍','营','葆','葵','蒙','蓉','蓓','蓝','蔓','蔚','蕊','蕙','蕴','蕾','薇','薪','虹','行','衍','裕','西','言',
		'誉','译','诗','诚','语','诺','谦','贝','贞','贤','质','贵','贺','赛','赞','赤','赫','起','超','越','跃','路','轩','转','轶','辉','辛','辰','达','迎','运','进','远','连','迪','述','迺','选','逢','逸','道','郁','配','醒','采','重',
		'野','金','鑫','钟','钦','钧','钰','铁','铭','银','锁','锐','锡','锦','镇','镜','长','闺','闻','阁','阳','阿','际','陆','雁','雅','雨','雪','雯','霁','霄','震','霞','露','青','靓','靖','静','非','革','韦','韫','音','韵','韶','顺',
		'颂','领','颖','颜','风','飞','香','馥','馨','骁','骏','高','魁','鲁','鲜','鸣','鸿','鹏','鹤','麟','黄','黎','默','齐','龙'
	};
	
	private static final char[] CH_FIRST_NAMES_F22 = new char[] {
		'一','丁','业','东','严','中','丰','临','丹','为','丽','举','久','义','之','乐','乔','也','书','乾','予','云','亚','京','亭','亮','人','仁','今','仙','令','仪','任','伊','伏','会','伟','伦','伶','余','佩','佳','依','侠','侨','俊',
		'俏','俐','俠','信','俭','修','倩','健','儒','儿','允','元','兄','先','光','克','党','全','兮','兰','兴','兵','其','冉','军','农','冬','冰','凌','凝','凡','凤','凯','函','分','刚','初','利','前','剑','力','功','加','勃','勇','勋',
		'勤','化','北','千','升','卉','华','卓','南','博','卫','印','卿','原','友','双','发','可','叶','合','吉','同','名','君','含','启','周','和','品','哲','唯','善','喆','喜','嘉','嘎','囡','园','国','圆','均','坚','坤','垚','城','培',
		'基','堂','堃','增','墨','声','复','夏','多','天','太','夫','夷','奇','奎','奕','女','好','如','妃','妍','妤','妮','妹','姐','姗','姝','姣','姬','姿','威','娃','娅','娇','娜','娟','娣','娥','娴','婉','婕','婧','婵','婷','媚','媛',
		'嫒','嫚','嫣','子','存','孝','学','宁','宇','安','宏','宜','宝','实','宣','宪','家','宸','容','宽','宾','寅','密','富','寒','寰','小','尔','尧','屏','山','屹','岐','岑','岚','岩','岭','岳','峰','嵘','巍','川','巧','帅','帆','希',
		'平','年','庄','庆','庚','庭','康','廉','延','廷','建','弘','弟','强','彤','彥','彦','彧','彩','彬','影','征','微','德','心','忆','志','忠','忱','怀','思','怡','恒','恕','恩','恬','悦','情','惠','意','慈','慧','懿','成','才','扬',
		'拉','捷','操','改','放','政','敏','敬','文','斌','斐','斯','新','方','旋','旎','旗','日','旭','时','旸','昀','昆','昊','昌','明','昕','星','春','昭','昱','显','晏','晓','晔','晖','晗','晨','普','景','晴','晶','智','暄','暖','曦',
		'曼','月','有','朋','朝','朦','木','朴','朵','权','杉','来','杨','杭','杰','松','林','果','枝','枫','柏','柔','柱','柳','栋','树','根','格','桂','桃','桐','桢','桥','桦','梅','梓','梦','棉','棋','棠','森','楚','楠','楼','榕','樱',
		'欢','欣','欧','歆','歌','正','武','歧','殊','毅','毓','氏','民','水','永','汇','汉','汐','汝','江','池','沙','沛','河','治','泉','泓','波','泽','洁','洋','津','洪','洲','浓','浩','海','涓','涛','润','涵','淇','淋','淑','深','淳',
		'淼','清','渊','湘','源','溪','滋','满','滢','滨','漪','漫','潇','潞','潼','澄','澜','濛','瀛','灵','灿','炎','炜','烈','烨','焕','焱','然','煊','煜','熙','熹','燃','燕','爱','爽','玉','玖','玢','玥','玫','玮','环','玲','玺','珂',
		'珈','珉','珊','珍','珏','珠','珩','珺','理','琛','琢','琦','琨','琪','琰','琳','琴','琼','瑄','瑛','瑜','瑞','瑶','瑾','璇','璐','璞','璠','甜','生','甫','田','申','男','畅','白','皎','盈','益','盼','眉','真','睿','瞳','知','石',
		'研','砚','硕','碧','磊','礁','礼','祎','祥','祯','祺','禄','福','禹','禾','秀','秋','科','程','稳','立','章','童','竹','笑','笛','第','筠','粉','素','繁','红','纯','纳','纹','绮','维','绵','缘','美','群','羽','翔','翘','翠','联',
		'聪','肖','育','胜','胡','臣','臻','舒','舞','舟','航','舫','良','艳','艺','艾','芊','芙','芝','芬','芮','芯','花','芳','芸','芹','苏','苓','苗','若','英','苹','范','茗','茜','茵','茹','荃','荟','荣','荷','荻','莉','莎','莲','莹',
		'莺','菁','菊','菡','菱','菲','萃','萌','萍','营','萱','葳','葵','蒙','蓉','蓓','蓝','蔓','蔚','蕊','蕙','蕴','蕾','薇','藩','蘅','虹','蛟','行','裕','西','言','誉','训','诗','语','诺','谊','谣','谦','豫','贝','贞','财','贤','贵',
		'贺','赢','赤','赫','起','超','越','跃','路','轩','轶','辉','辛','辰','达','迎','运','进','远','连','迪','逸','道','遥','郁','野','金','鑫','钟','钦','钧','钰','铃','铎','铭','铮','银','锁','锋','锐','锡','锦','闻','阁','阳','陶',
		'雁','雄','雅','雨','雪','雯','雷','霄','霏','霓','霖','霜','霞','露','青','靓','靖','静','非','革','韬','音','韵','顺','领','颐','颖','颜','风','飞','香','馥','馨','驰','骄','魁','鲜','鸣','鸥','鸽','鸾','鸿','鹏','鹤','鹭','鹰',
		'麟','黎','默','齐','龄','龙'
	};
	
	private static final char[] CH_FIRST_NAMES_M1 = new char[] {
		'一','丁','业','丛','东','严','中','丰','丹','为','丽','举','义','乐','乔','也','书','乾','争','云','京','亮','仁','仓','付','令','仪','仲','任','众','会','伟','伦','余','佳','侃','侠','俊','信','俭','健','傲','儒','允','元','光',
		'克','全','兴','兵','典','冀','军','冠','冬','冰','冲','冶','凌','凡','凤','凯','列','刚','利','前','剑','力','功','劲','勃','勇','勋','勤','北','千','升','华','卓','南','博','占','卫','印','卿','原','友','双','发','可','合','吉',
		'君','启','和','咏','品','响','哲','唯','啸','喆','喜','嘉','国','圣','地','均','坚','坤','垚','城','堂','堃','增','墨','壮','声','复','多','天','太','夺','奇','奎','奔','奕','奥','威','子','存','季','学','宁','宇','安','宏','宝',
		'实','宪','家','宽','宾','寅','密','富','寒','尚','尧','展','山','屹','岐','岗','岚','岩','岭','岱','岳','峥','峰','峻','崇','崴','嵩','嵬','巍','川','巨','帅','帆','希','平','广','庆','库','庚','康','庸','延','廷','建','开','引',
		'弘','弛','强','录','彤','彦','彧','彪','彬','影','征','微','德','心','志','忠','忱','怀','思','恒','恕','恩','恺','悦','惠','想','意','慧','懿','戈','成','战','才','扬','承','拓','振','挺','捷','操','攀','放','政','敏','敢','敬',
		'文','斌','斐','斯','新','方','旗','日','旭','时','旸','旺','昂','昆','昊','昌','明','易','昕','星','春','昭','昱','昶','显','晋','晓','晔','晖','晗','晟','晨','晶','智','曦','月','有','朋','朔','朕','朗','望','朝','木','权','来',
		'杨','杭','杰','松','林','枫','柏','柯','柱','柳','标','栋','树','根','桐','桓','桥','桦','梁','森','植','楚','楠','楷','樵','欢','欣','歆','歌','正','武','毅','民','水','永','汉','江','沛','河','治','泉','泓','波','泰','泳','泽',
		'洁','洋','津','洪','洲','济','浩','海','涌','涛','润','涵','深','淳','添','淼','清','渤','港','游','湃','湛','源','滔','满','滨','潇','潮','澄','澍','澎','瀚','瀛','灏','灿','炎','炜','炬','烁','烈','烨','焕','焰','焱','然','煜',
		'熙','熠','燕','爽','牧','特','状','猛','玉','玥','玮','玲','玺','珂','珍','珏','珩','理','琛','琢','琦','琨','琪','琳','琼','瑛','瑜','瑞','瑶','瑾','璐','璞','生','田','申','男','畅','畏','疆','皓','盈','盛','直','真','睿','石',
		'研','硕','磊','礼','祎','祥','祺','禄','福','禹','禾','秀','秋','科','程','立','竞','童','笑','笛','策','红','纪','纯','纲','继','绪','维','罡','群','羽','翀','翔','翼','耀','耕','聪','肃','育','胜','胤','腾','臣','臻','舒','航',
		'舰','良','艳','艺','芳','苏','英','茁','茂','荣','莹','菲','萌','萍','营','蒙','蔚','蕾','虎','虹','蛟','行','衡','裕','言','试','诚','诺','谦','豪','财','贤','贵','贺','赛','赞','赢','赤','赫','起','超','越','跃','路','轩','轶',
		'辉','辛','辰','达','迁','迅','迎','运','进','远','连','迪','述','逊','通','遥','郁','里','重','野','金','鉴','鑫','钊','钟','钢','钦','钧','钰','铁','铎','铭','铮','银','铸','锁','锋','锐','锦','键','锴','镇','镝','镭','闯','阁',
		'阔','阳','陆','雁','雄','雨','雪','雷','霄','霆','震','霖','露','青','靓','靖','静','非','革','韧','韬','音','顺','颖','风','飞','驰','骁','骋','骏','骞','骥','魁','鲁','鲲','鸣','鸿','鹏','鹤','鹰','麟','黎','默','鼎','齐','龙'		
	};
	
	private static final char[] CH_FIRST_NAMES_M21 = new char[] {
		'一','丁','万','三','上','与','丕','世','丙','业','丛','东','丞','严','中','丰','临','丹','为','丽','举','乃','久','义','之','乐','乔','乙','九','也','习','书','乾','予','争','二','于','云','五','井','亚','亦','亨','享','京','亭',
		'亮','人','亿','仁','今','介','从','仕','付','代','令','以','仪','仰','仲','任','伊','伍','伏','众','会','伟','传','伦','伯','佃','佐','佑','体','余','作','佩','佰','佳','依','俊','保','信','俣','俭','修','健','傲','儒','允','元',
		'兆','先','光','克','党','全','公','六','兰','关','兴','兵','其','典','冀','再','军','冠','冬','冰','冲','凌','凡','凤','凯','则','刚','初','利','前','剑','力','功','加','务','劲','勃','勇','勋','勤','化','北','千','升','华','卓',
		'南','博','卜','占','卫','印','卿','历','厚','原','又','友','双','发','叔','叙','古','召','可','叶','司','合','吉','同','名','后','向','君','含','启','呈','周','和','咏','咸','品','哲','唯','啟','啸','善','喆','喜','嗣','嘉','四',
		'国','圣','在','地','均','坤','垂','城','培','基','堂','增','墨','士','壮','声','复','夏','夕','多','大','天','太','夫','奇','奉','奎','奕','奥','好','如','威','子','孔','存','孝','孟','季','学','宁','宇','守','安','宏','宗','官',
		'定','宜','宝','实','宠','宣','宪','宴','宵','家','宸','容','宽','宾','寅','密','富','寒','寰','寿','尉','尊','小','少','尔','尚','尧','居','展','履','山','屹','岐','岚','岩','岫','岭','岱','岳','峥','峰','峻','崇','嵩','巍','川',
		'左','巧','巨','巴','布','帅','师','希','席','帮','常','平','年','幸','幼','广','庆','序','应','庚','庭','庶','康','廉','延','廷','建','开','式','弘','弟','强','弼','录','彤','彥','彦','彩','彬','彭','影','征','得','德','心','必',
		'志','忠','忱','念','怀','思','怡','恒','恕','恩','恭','恺','悦','惠','意','慎','慕','慧','懋','懿','戈','成','战','所','才','执','扬','承','拉','拥','持','指','振','捍','捷','援','政','效','敏','教','敦','敬','文','斌','斗','斯',
		'新','方','施','日','旭','时','旺','昀','昆','昊','昌','明','易','昕','星','映','春','昭','昱','昶','显','晋','晏','晓','晔','晗','晟','晨','普','景','晴','晶','智','曙','曦','曰','更','曾','月','有','朋','朔','朕','朗','望','朝',
		'木','本','术','权','李','来','杨','杭','杰','松','林','果','枝','枫','柄','柏','柯','柱','柳','栋','树','栓','校','栢','栩','根','格','桂','桐','桓','梅','梓','梦','森','植','楚','楠','楷','欢','欣','正','步','武','歧','殿','毅',
		'毓','民','水','永','汇','汉','汝','江','汶','沅','沈','沐','沛','沫','河','治','沿','泉','泊','泓','法','波','泮','泰','泳','泽','洁','洋','津','洪','洺','流','济','浚','浦','浩','海','涌','涛','涤','润','涵','淇','淏','淑','淞',
		'淮','深','淳','添','清','渊','渝','渤','温','湘','湛','源','溪','滋','满','滨','潇','潮','澄','瀚','灏','火','灵','灿','炎','炜','炫','炯','炳','烁','烈','烨','焕','焱','然','煜','照','熙','燕','爱','爽','牧','特','献','玄','玉',
		'玖','玮','环','现','玲','玺','珂','珈','珍','珠','珺','理','琦','琪','琳','瑛','瑜','瑞','璐','璟','生','用','甫','田','甲','申','电','畅','界','留','登','白','百','皓','盈','益','盛','相','省','真','睿','知','石','研','砚','硕',
		'碧','磊','礼','社','祉','祎','祖','祚','祝','祥','祯','祺','禄','福','禹','秀','秉','秋','科','积','程','立','竞','竟','章','竣','端','竹','笃','笑','筱','精','素','紫','繁','红','纪','纯','绍','经','结','统','绥','继','绪','续',
		'维','绵','美','群','羽','羿','翊','翔','翠','翰','翼','耀','者','耕','耘','耿','联','聚','聪','肃','肇','肖','育','胜','胤','能','腾','臣','自','至','致','舒','舜','舟','航','良','艳','艺','艾','芝','芳','芷','芸','苏','若','英',
		'茂','范','茗','茹','荣','荫','莫','莲','莹','菊','营','葆','著','蓬','蔚','蕴','薪','虎','虹','行','衍','裕','西','要','见','观','言','誉','计','训','记','译','试','诗','诚','语','谋','谦','象','豪','豫','贞','财','贤','质','贯',
		'贵','贺','贻','资','赛','赞','赤','赫','起','超','越','跃','路','轩','轶','载','辅','辉','辛','辰','辽','达','迎','运','近','进','远','连','迪','述','迺','选','通','造','逢','逸','道','遵','那','邦','邵','郁','郡','都','配','醒',
		'里','重','野','金','鉴','鑫','钊','钟','钢','钦','钧','钰','铁','铂','铎','铜','铠','铭','银','铸','锁','锋','锐','锡','锦','镇','镜','长','闻','阁','阜','阳','阿','际','陆','险','陶','隆','隽','雁','雄','雅','集','雍','雨','雪',
		'雯','雷','霁','霄','震','霖','露','青','靖','静','革','韦','音','韵','韶','顶','顺','颂','领','颖','颜','颢','风','飞','首','香','馨','骁','骏','骐','骥','高','魁','鲁','鸣','鸿','鹏','鹤','麒','麟','黎','默','鼎','齐','龙'
	};
	
	private static final char[] CH_FIRST_NAMES_M22 = new char[] {
		'一','丁','万','三','专','丕','世','业','丛','东','丞','严','中','丰','临','丹','为','丽','举','久','义','之','乐','乔','乙','九','也','习','书','乾','予','争','于','云','五','亚','亨','京','亭','亮','人','亿','仁','今','仑','仓',
		'仕','付','仙','仟','代','令','仪','仲','任','伊','伍','伏','众','会','伟','传','伦','伯','伶','伸','佐','佑','余','作','佩','佰','佳','侠','侨','俊','保','信','俭','修','健','傲','儒','允','元','兆','先','光','克','党','全','公',
		'兰','关','兴','兵','其','典','冉','军','农','冠','冬','冰','冲','冶','凌','凡','凤','凯','函','列','则','刚','初','利','前','剑','力','功','加','勃','勇','勋','勒','勤','化','北','千','升','午','华','卓','南','博','卜','占','卫',
		'印','卿','厚','原','友','双','发','古','召','可','台','叶','合','吉','同','名','后','吐','向','君','含','启','吾','呈','员','周','和','品','哲','唐','唯','啟','啸','善','喆','喜','嘉','嘎','园','国','图','圃','圆','圣','在','地',
		'圻','均','坚','坡','坤','坦','垚','垣','城','培','基','堂','堃','增','墨','壁','士','壮','声','壹','复','夏','多','大','天','太','夫','夺','奇','奉','奎','奕','奥','好','如','委','威','娇','娟','娥','媛','子','孔','存','孚','孝',
		'孟','学','宁','宇','守','安','宏','宗','官','宜','宝','实','宣','宪','宴','家','宸','容','宽','宾','寅','富','寒','寰','寿','尊','尔','尘','尚','尧','居','屏','展','山','屹','岐','岑','岗','岚','岩','岫','岭','岱','岳','峥','峰',
		'峻','崇','崎','崑','嵩','巍','川','州','工','巨','布','帅','帆','师','希','帮','常','平','年','广','庄','庆','序','库','庚','庭','康','庸','廉','延','廷','建','开','弘','弛','弟','弢','强','弼','录','彤','彥','彦','彧','彩','彪',
		'彬','彭','彰','影','征','律','得','微','德','徽','心','志','忠','忱','怀','思','怡','恒','恕','恩','恭','恺','悦','惠','意','愚','慈','慧','懿','戈','成','战','所','才','扬','承','拉','拥','振','捷','援','搏','操','收','放','政',
		'敏','敖','敦','敬','文','斋','斌','斐','斗','斯','新','方','旋','旗','日','旭','时','旸','旺','旻','昂','昆','昇','昊','昌','明','易','昕','星','春','昭','昱','昶','显','晋','晏','晓','晔','晖','晗','晟','晨','普','景','晶','智',
		'暄','曙','曦','更','曾','月','有','朋','服','朔','朗','望','朝','木','本','术','朴','权','杉','材','村','来','杨','杭','杰','松','林','果','枝','枢','枫','柏','柯','柱','标','栋','树','栓','校','栢','根','格','桂','桐','桓','桢',
		'桥','梁','梅','梓','棉','棋','棠','棣','森','植','楚','楠','楷','楼','榜','槐','模','樵','欢','欣','欧','歌','正','武','歧','殿','毅','毓','氏','民','水','永','汇','汉','汗','江','池','沅','沈','沛','沣','河','治','泉','泓','法',
		'波','泰','泳','泷','泽','洁','洋','洙','津','洪','洲','济','浦','浩','海','涌','涛','润','涵','淇','淋','淏','淞','淮','深','淳','添','淼','清','渊','渠','渤','温','渭','港','湖','湘','源','溟','溢','溥','溪','滋','滔','满','滨',
		'潇','潜','潭','潮','潼','澄','澍','澎','澜','澳','濂','瀚','瀛','灏','灵','灿','炎','炜','炳','烁','烈','烨','焕','焱','然','煊','煌','煜','照','熙','熠','熹','燃','燕','燮','爱','爽','牛','特','猛','献','猷','玉','玖','玮','环',
		'现','玲','玺','珂','珉','珊','珍','珏','珑','珠','珩','珺','球','理','琛','琢','琦','琨','琪','琮','琳','琴','琼','瑀','瑄','瑛','瑜','瑞','瑶','瑾','璇','璋','璐','璞','璠','生','用','甫','田','甲','申','男','畅','界','略','疆',
		'白','百','皓','盈','益','盛','盟','直','相','省','真','睿','知','石','研','砚','硕','碧','磊','礼','社','祎','祖','祚','祜','祝','祥','祯','祺','禄','福','禧','禹','禾','秀','秋','科','程','立','章','竣','童','端','竹','笑','符',
		'第','策','筠','精','繁','红','纪','纬','纯','纲','绅','绍','经','继','绪','续','维','绵','缘','罡','美','群','羲','羽','翀','翊','翔','翠','翥','翰','翱','翼','耀','考','耕','联','聚','聪','肃','肖','育','胜','胡','胤','能','腾',
		'臣','至','臻','舒','舜','舟','航','舫','舰','良','艳','艺','芝','芬','芳','芹','苏','苓','苗','若','英','茁','茂','范','茗','茹','荣','荫','莆','莲','莹','菊','菲','萌','萍','营','萱','葆','葵','蒙','蓬','蔚','蕴','蕾','藩','虎',
		'虹','蛟','融','行','衍','衡','裕','西','见','言','誉','让','训','记','设','译','诗','诚','详','语','诺','谊','谋','谦','谭','豪','豹','贞','财','贤','贵','贺','赋','赐','赞','赢','赤','赫','起','超','越','跃','路','身','轩','轮',
		'轶','辅','辉','辛','辰','达','迁','迅','迎','运','进','远','连','迪','述','选','逊','通','逸','道','遥','邑','那','邦','郁','郡','都','里','重','野','金','鉴','鑫','钊','钟','钢','钦','钧','钰','钱','铁','铄','铉','铎','铖','铜',
		'铨','铭','铮','银','铸','锁','锋','锐','锟','锡','锦','键','锴','镇','镐','镛','镝','长','门','闯','闻','阁','阔','阳','阶','际','陆','陵','陶','隆','隽','雁','雄','雅','雨','雪','雯','雷','霄','霆','震','霏','霖','霞','露','青',
		'靖','静','非','革','韬','音','顶','顺','领','颐','颖','颜','风','飞','香','馥','馨','驰','驹','骁','骄','骅','骏','骐','骞','骥','高','魁','鲁','鳌','鸣','鸥','鸿','鹏','鹤','鹰','鹿','麒','麟','黎','默','鼎','齐','龄','龙'
	};	

	public static final String randomPhoneNumber(String pn) {
		if (StringUtils.isNotEmpty(pn) && pn.length() >= 2) {
			StringBuilder sb = new StringBuilder();
			sb.append(pn.charAt(0));
			for(int i=1; i<pn.length(); i++) {
				char ch = pn.charAt(i);
				if (ch >= DIGITS[0] && ch <= DIGITS[DIGITS.length-1]) {
					sb.append(DIGITS[randomInt(DIGITS.length)]);
				} else {
					sb.append(ch);
				}
			}
			return sb.toString();
		}
		return pn;
	}
	
	public static final String randomName(String nm, String sex) {
		if (StringUtils.isNotEmpty(nm)) {
			StringBuilder sb = new StringBuilder();
			sb.append(CH_FAMILY_NAMES[randomInt(CH_FAMILY_NAMES.length)]);
			
			if (StringUtils.equalsIgnoreCase(sex, "F")) {
				if (nm.length() == 2) {
					sb.append(CH_FIRST_NAMES_F1[randomInt(CH_FIRST_NAMES_F1.length)]);
				} else if (nm.length() >= 3) {
					sb.append(CH_FIRST_NAMES_F21[randomInt(CH_FIRST_NAMES_F21.length)]);
					sb.append(CH_FIRST_NAMES_F22[randomInt(CH_FIRST_NAMES_F22.length)]);
				}
			} else {
				if (nm.length() == 2) {
					sb.append(CH_FIRST_NAMES_M1[randomInt(CH_FIRST_NAMES_M1.length)]);
				} else if (nm.length() >= 3) {
					sb.append(CH_FIRST_NAMES_M21[randomInt(CH_FIRST_NAMES_M21.length)]);
					sb.append(CH_FIRST_NAMES_M22[randomInt(CH_FIRST_NAMES_M22.length)]);
				}
			}
			
			String newName = sb.toString();
			if (StringUtils.equalsIgnoreCase(nm, newName)) {
				return randomName(nm, sex);
			} else {
				return newName;
			}
			
		}
		return nm;
	}
}
